emacs/configs/11-platform-linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf5a7d0a">1. Linux-Specific Configuration</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf5a7d0a" class="outline-2">
<h2 id="orgf5a7d0a"><span class="section-number-2">1.</span> Linux-Specific Configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
Settings that only apply on Linux systems.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">linux-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">m180/font-set</span> ()
  <span class="org-doc">"Font settings for linux."</span>
  (set-face-attribute 'default nil <span class="org-builtin">:family</span> <span class="org-string">"Iosevka Nerd Font Mono"</span> <span class="org-builtin">:height</span> 120 <span class="org-builtin">:weight</span> 'light)
  (set-fontset-font t 'hangul (font-spec <span class="org-builtin">:name</span> <span class="org-string">"NotoSansKR"</span>)))

(<span class="org-keyword">if</span> (daemonp)
      (add-hook 'server-after-make-frame-hook #'m180/font-set)
  (m180/font-set))

(<span class="org-keyword">provide</span> '<span class="org-constant">linux-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">linux-conf.el ends here</span>
</pre>
</div>
</div>
</div>
</main>
</body>
</html>
